var game_example_0 =
	[{"x":27,"y":13},{"x":26,"y":13},{"x":30,"y":12},{"x":26,"y":12},{"x":28,"y":14},{"x":26,"y":14},{"x":26,"y":15},{"x":27,"y":15},{"x":28,"y":16},{"x":26,"y":11},{"x":26,"y":10},{"x":24,"y":12},{"x":25,"y":12},{"x":24,"y":14},{"x":25,"y":13},{"x":27,"y":12},{"x":25,"y":14},{"x":25,"y":15},{"x":28,"y":13},{"x":28,"y":17},{"x":23,"y":13}];

var game_example_1 = 
	[{"x":20,"y":15},{"x":21,"y":15},{"x":23,"y":13},{"x":23,"y":14},{"x":22,"y":13},{"x":19,"y":13},{"x":21,"y":14},{"x":23,"y":12},{"x":24,"y":13},{"x":25,"y":13},{"x":20,"y":13},{"x":21,"y":13},{"x":20,"y":14},{"x":20,"y":12},{"x":19,"y":12},{"x":22,"y":15},{"x":20,"y":17},{"x":20,"y":16},{"x":19,"y":16},{"x":18,"y":17},{"x":18,"y":14},{"x":19,"y":14},{"x":18,"y":15},{"x":17,"y":14},{"x":24,"y":14},{"x":22,"y":14}];

var game_example_2 = 
	[{"x":51,"y":10},{"x":52,"y":10},{"x":51,"y":7},{"x":51,"y":8}]

var game_example_3 =  // много вариантов ходов, нейтральная оценка
	[{"x":52,"y":14},{"x":53,"y":14},{"x":52,"y":11},{"x":52,"y":12},{"x":54,"y":11},{"x":53,"y":13},{"x":53,"y":10},{"x":51,"y":11},{"x":54,"y":14},{"x":51,"y":12},{"x":55,"y":12},{"x":52,"y":9},{"x":54,"y":12}]

var game_example_4 = // тут компьютер тупит, является ли ход ( 2, 0 ) за крестики проигрышным; для решения см. game_example_5
	[{"x":46,"y":13},{"x":47,"y":13},{"x":46,"y":10},{"x":46,"y":11},{"x":44,"y":11},{"x":47,"y":12},{"x":47,"y":11},{"x":47,"y":14},{"x":45,"y":10},{"x":47,"y":15},{"x":47,"y":16},{"x":49,"y":14},{"x":48,"y":13},{"x":48,"y":14},{"x":46,"y":14},{"x":49,"y":13},{"x":46,"y":16},{"x":50,"y":12},{"x":51,"y":11}];

var game_example_win_0 = 
	[{"x":33,"y":13},{"x":33,"y":15},{"x":36,"y":13},{"x":34,"y":13},{"x":33,"y":10},{"x":37,"y":14},{"x":34,"y":11},{"x":33,"y":11},{"x":35,"y":10},{"x":33,"y":12},{"x":36,"y":10},{"x":34,"y":10},{"x":35,"y":12},{"x":32,"y":9},{"x":35,"y":11},{"x":32,"y":14},{"x":35,"y":9},{"x":36,"y":15},{"x":35,"y":13}]

var game_example_win_1 =
	[{"x":41,"y":12},{"x":42,"y":12},{"x":41,"y":9},{"x":43,"y":11},{"x":41,"y":13},{"x":41,"y":11},{"x":40,"y":10},{"x":42,"y":11},{"x":40,"y":11},{"x":42,"y":13},{"x":42,"y":10},{"x":43,"y":10},{"x":40,"y":12},{"x":42,"y":14},{"x":42,"y":15},{"x":45,"y":11},{"x":44,"y":11},{"x":40,"y":9}]; // следующим ходом ( -2, 0 ) крестики побеждают; возможно, другими тоже

var game_example_analyze_0 =
	[{"x":41,"y":12},{"x":42,"y":12},{"x":41,"y":9},{"x":43,"y":11},{"x":40,"y":10},{"x":41,"y":13},{"x":44,"y":10},{"x":42,"y":10},{"x":43,"y":9},{"x":39,"y":11},{"x":42,"y":9},{"x":40,"y":9},{"x":44,"y":9},{"x":45,"y":9},{"x":44,"y":11},{"x":40,"y":14},{"x":39,"y":15},{"x":44,"y":12},{"x":43,"y":10}]; // найти, в каком ходе ошиблись нолики

var game_example_5 =
	[{"x":48,"y":13},{"x":49,"y":13},{"x":48,"y":10},{"x":50,"y":12},{"x":47,"y":11},{"x":48,"y":14},{"x":51,"y":11},{"x":49,"y":11},{"x":50,"y":10},{"x":52,"y":12},{"x":51,"y":10},{"x":49,"y":10},{"x":49,"y":12},{"x":47,"y":14},{"x":51,"y":14},{"x":47,"y":15},{"x":46,"y":16},{"x":46,"y":14},{"x":49,"y":14}];


function ai_test( a, b, c ) {
	return function() {
		andrej_move.k_static = a;
		//andrej_move.k_static_positional_decrease_exp = a;
		//andrej_move.k_static_positional_increase = b;
		//andrej_move.k_recursive_val = c;
		andrej_move.k_recursive = b;//Math.log(2)/Math.log(andrej_move.k_recursive_val); // просто константа, от балды;
		andrej_move.kk_me = 0;
		andrej_move.backward_index = 0;
		andrej_move.adjust_indexes = function(){};
		andrej_move({width:ai_test.width[c]});
	}
}

ai_test.width = [
	[15,[8,null]],
	[15,[7,[3,[2,[2,[2,null]]]]]],
	[15,[10,[10,[2,[2,[4,null]]]]]]
];

// d - шаг по логанифмической шкале (1.5 значит в 1.5 раза)
// n - количество вариантов
function gen_participants( d, n ) {
	if( typeof(n) == 'number' )
		n = [ n, n, n ];
	var p = [];
	var a0 = 25;
	var b0 = 5;
	var c0 = 0;
	for( var i=0; i<n[0]; i++ ) {
		var aa = Math.exp(Math.log(a0)+(-((n[0]-1)/2|0)+i)*Math.log(d));
		for( var j=0; j<n[1]; j++ ) {
			var bb = Math.exp(Math.log(b0)+(-((n[1]-1)/2|0)+j)*Math.log(d));
			for( var k=0; k<n[2]; k++ ) {
				var cc = k;//Math.exp(Math.log(c0)+(-((n[2]-1)/2|0)+k)*Math.log(d));
				var pp = new ai_test( aa, bb, cc );
				pp.title = '( '+r(aa)+', '+r(bb)+', '+'w'/*r(cc)*/+' )';
				p.push(pp);
			}
		}
	}
	return p;
}

function gen_p( arg ) {
	var p1_1 = [
		ai_0_0_4_10_6s,
		//ai_0_0_4_10_10s,
		ai_0_0_4_10_static
	];
	var p1_2 = [
		ai_0_0_3_6s,
		//ai_0_0_3_10s
	];
	if( arg==0 )
		var p1 = p1_1;
	if( arg==1 )
		p1 = p1_2;
	if( ( arg!=0 ) && ( arg!=1 ) )
		p1 = p1_1.concat(p1_2);
	p1_1[0].title = 'ai_0_0_4_10_6s';
	//p1_1[1].title = 'ai_0_0_4_10_10s';
	p1_1[1].title = 'ai_0_0_4_10_static';
	p1_2[0].title = 'ai_0_0_3_6s';
	//p1_2[1].title = 'ai_0_0_3_10s';
	return [p1,gen_participants(1.7,[3,3,3])];
}
